Reports/СверкаОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Report>
		<Properties>
			<Name>СверкаОстатков</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаМесяцаСверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураВ77</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураВ83</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаРасхождений</Name>
					<Type>
						<v8:Type>mxl:SpreadsheetDocument</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаРасхожденияОборотов</Name>
					<Type>
						<v8:Type>mxl:SpreadsheetDocument</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладВ77</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладВ83</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаМесяцаСверкиОборотов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОстаткиИОбороты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>7</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачальныйОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приход</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расход</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонечныйОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Признак</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/Остатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>Остатки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПартии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВыпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Reports/СверкаОстатков/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиКомандФормы

&НаСервере
Процедура ЗаполнитьНаСервере()
	База = Неопределено;
    РезультатПодключения = Неопределено;
    ОбщегоНазначенияСервер.ПодключениеК1С77(База, РезультатПодключения);
	Если НЕ РезультатПодключения Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "НЕ ПОДКЛЮЧИЛИСЬ К 1С 7.7";
		Сообщение.Сообщить(); 
		Возврат;
	КонецЕсли;
	
	ТЗОстаткиИОбороты7 = Новый ТаблицаЗначений;
	ТЗОстаткиИОбороты7.Колонки.Добавить("Номенклатура");
	ТЗОстаткиИОбороты7.Колонки.Добавить("Склад");
	ТЗОстаткиИОбороты7.Колонки.Добавить("НачальныйОстаток");
	ТЗОстаткиИОбороты7.Колонки.Добавить("КонечныйОстаток");
	ТЗОстаткиИОбороты7.Колонки.Добавить("Приход");
	ТЗОстаткиИОбороты7.Колонки.Добавить("Расход");
	ТЗОстаткиИОбороты7.Колонки.Добавить("Признак");
	ТЗОстаткиИОбороты7.Колонки.Добавить("УдалитьЗначение");
	
	БИ = База.CreateObject("БухгалтерскиеИтоги");
	
	СчетОборотов = "10.1";
	СубконтоМатериалов = База.ВидыСубконто.Материалы;
	ВыборкаОборотовИз77(База, БИ, СубконтоМатериалов, СчетОборотов, ТЗОстаткиИОбороты7);
	
	СчетОборотов = "21";
	СубконтоМатериалов = База.ВидыСубконто.Материалы;
	ВыборкаОборотовИз77(База, БИ, СубконтоМатериалов, СчетОборотов, ТЗОстаткиИОбороты7);
	
	СчетОборотов = "43";
	СубконтоМатериалов  = База.ВидыСубконто.Номенклатура;
	ВыборкаОборотовИз77(База, БИ, СубконтоМатериалов, СчетОборотов, ТЗОстаткиИОбороты7);	
	
	База = NULL;
	ТЗОстаткиИОбороты7.Свернуть("Номенклатура, Склад, Признак, УдалитьЗначение", "НачальныйОстаток, КонечныйОстаток, Приход, Расход");
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиОстаткиИОбороты.Номенклатура.Наименование КАК Номенклатура,
		|	ОстаткиОстаткиИОбороты.Склад.КодВ77 КАК Склад,
		|	СУММА(ОстаткиОстаткиИОбороты.КоличествоНачальныйОстаток) КАК НачальныйОстаток,
		|	СУММА(ОстаткиОстаткиИОбороты.КоличествоКонечныйОстаток) КАК КонечныйОстаток,
		|	СУММА(ОстаткиОстаткиИОбороты.КоличествоПриход) КАК Приход,
		|	СУММА(ОстаткиОстаткиИОбороты.КоличествоРасход) КАК Расход
		|ИЗ
		|	РегистрНакопления.Остатки.ОстаткиИОбороты(&НачальнаяДата, &КонечнаяДата, Месяц, , ) КАК ОстаткиОстаткиИОбороты
		|ГДЕ
		|	ОстаткиОстаткиИОбороты.Склад.КодВ77 <> &ПустоеПоле
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиОстаткиИОбороты.Номенклатура.Наименование,
		|	ОстаткиОстаткиИОбороты.Склад.КодВ77";
		
	Запрос.УстановитьПараметр("НачальнаяДата", НачалоМесяца(Объект.ДатаМесяцаСверки));
	Запрос.УстановитьПараметр("КонечнаяДата", КонецМесяца(Объект.ДатаМесяцаСверки));
	Запрос.УстановитьПараметр("ПустоеПоле", "");
	
	ТЗОстаткиИОбороты8 = Запрос.Выполнить().Выгрузить();
	ТЗОстаткиИОбороты8.Колонки.Добавить("УдалитьЗначение");
	ТЗОстаткиИОбороты8.Колонки.Добавить("Признак");
	
	ТЗОстаткиИОбороты7.ЗаполнитьЗначения(0, "УдалитьЗначение");
	ТЗОстаткиИОбороты8.ЗаполнитьЗначения(0, "УдалитьЗначение");
	ТЗОстаткиИОбороты8.ЗаполнитьЗначения("8.3", "Признак");
	
	Для Каждого Стр8 Из ТЗОстаткиИОбороты8 Цикл
		Для Каждого Стр7 Из ТЗОстаткиИОбороты7 Цикл
			Если Стр8.Номенклатура = Стр7.Номенклатура 
				И Стр8.Склад = Стр7.Склад 
				И Окр(Стр8.НачальныйОстаток, 3) = Окр(Стр7.НачальныйОстаток, 3) 
				И Окр(Стр8.КонечныйОстаток, 3) = Окр(Стр7.КонечныйОстаток, 3) 
				И Окр(Стр8.Приход, 3) = Окр(Стр7.Приход, 3) 
				И Окр(Стр8.Расход, 3) = Окр(Стр7.Расход, 3) Тогда
				 
				Стр8.УдалитьЗначение = 1;
				Стр7.УдалитьЗначение = 1;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	НулевыеСтроки = ТЗОстаткиИОбороты8.НайтиСтроки(Новый Структура("УдалитьЗначение",1));
	Для каждого СтрокаТаблицы Из НулевыеСтроки Цикл
		ТЗОстаткиИОбороты8.Удалить(СтрокаТаблицы)
	КонецЦикла;	
	НулевыеСтроки = ТЗОстаткиИОбороты7.НайтиСтроки(Новый Структура("УдалитьЗначение",1));
	Для каждого СтрокаТаблицы Из НулевыеСтроки Цикл
		ТЗОстаткиИОбороты7.Удалить(СтрокаТаблицы)
	КонецЦикла;	
	
	Объект.ОстаткиИОбороты.Очистить();
	
	ЗаполнениеФормы(ТЗОстаткиИОбороты7);
	ЗаполнениеФормы(ТЗОстаткиИОбороты8);
	
	Объект.ОстаткиИОбороты.Сортировать("Склад, Признак, Номенклатура");
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
	Расхождения();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнениеФормы(Знач ТЗОстаткиИОбороты78)
	
	Перем НоваяСтрокаТаблицы, Стр;
	
	Для Каждого Стр Из ТЗОстаткиИОбороты78 Цикл
		НоваяСтрокаТаблицы = Объект.ОстаткиИОбороты.Добавить();
		НоваяСтрокаТаблицы.Номенклатура = Стр.Номенклатура;
		НоваяСтрокаТаблицы.Склад = Стр.Склад;
		НоваяСтрокаТаблицы.НачальныйОстаток = Стр.НачальныйОстаток;
		НоваяСтрокаТаблицы.КонечныйОстаток = Стр.КонечныйОстаток;
		НоваяСтрокаТаблицы.Приход = Стр.Приход;
		НоваяСтрокаТаблицы.Расход = Стр.Расход;
		НоваяСтрокаТаблицы.Признак = Стр.Признак;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ВыборкаОборотовИз77(Знач База, Знач БИ, СубконтоМатериалов, СчетОборотов, Знач ТЗОстаткиИОбороты7)
	
	Перем СтрокаОстатков, СубконтоМестаХранения, Счет10;
	
	СубконтоМестаХранения = База.ВидыСубконто.МестаХранения;
	БИ.ИспользоватьСубконто(СубконтоМатериалов);
	БИ.ИспользоватьСубконто(СубконтоМестаХранения);
	Счет10 = База.CreateObject("Счет");
	Счет10.НайтиПоКоду(СчетОборотов);
	БИ.ВыполнитьЗапрос(НачалоМесяца(Объект.ДатаМесяцаСверки),КонецМесяца(Объект.ДатаМесяцаСверки),Счет10,"","","","Месяц","К");
	БИ.ВыбратьСубконто(1);
	Пока БИ.ПолучитьСубконто(1) = 1 Цикл
		БИ.ВыбратьСубконто(2);
		Пока БИ.ПолучитьСубконто(2) = 1 Цикл
			СтрокаОстатков = ТЗОстаткиИОбороты7.Добавить();
			СтрокаОстатков.Номенклатура = БИ.Субконто(1).Наименование;
			СтрокаОстатков.Склад = БИ.Субконто(2).Код;
			СтрокаОстатков.НачальныйОстаток = БИ.СНД("К");
			СтрокаОстатков.КонечныйОстаток =  БИ.СКД("К");
			СтрокаОстатков.Приход = БИ.ДО("К");
			СтрокаОстатков.Расход = БИ.КО("К");
			СтрокаОстатков.Признак = "7.7";
		КонецЦикла;		
	КонецЦикла;

КонецПроцедуры


&НаСервере
Функция РасхожденияНаСервере()
	ТабДок = Новый ТабличныйДокумент;
		
	ОстаткиИОбороты = Новый Массив;
	СтруктураСтрокой = "";
	НужнаЗапятая = Ложь;
	СтруктураСтрокой = "Номенклатура, Склад, НачальныйОстаток, Приход, Расход, КонечныйОстаток, Признак";
	Для Каждого Строка Из Объект.ОстаткиИОбороты Цикл
		НоваяСтрока = Новый Структура(СтруктураСтрокой);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		ОстаткиИОбороты.Добавить(НоваяСтрока);
	КонецЦикла;
	
	Макет = Отчеты.СверкаОстатков.ПолучитьМакет("ТаблицаРасхождений");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьСклад = Макет.ПолучитьОбласть("Склад");
	ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	
	ТабДок.Вывести(ОбластьЗаголовок);	
	
	ТЗСкладов = Новый ТаблицаЗначений;
	ТЗСкладов.Колонки.Добавить("Склад");
	
	ТЗОстаткиИОбороты = Новый ТаблицаЗначений;
	Для Каждого СтрокаМассива Из ОстаткиИОбороты Цикл
		Для Каждого СтрокаСтруктуры Из СтрокаМассива Цикл
			
			Если Строка(ТипЗнч(СтрокаСтруктуры.Значение)) = "Строка" Тогда
				ТипДанных = Новый ОписаниеТипов(Строка(ТипЗнч(СтрокаСтруктуры.Значение)),,,,Новый КвалификаторыСтроки(100));
			Иначе 
				ТипДанных = Новый ОписаниеТипов(Строка(ТипЗнч(СтрокаСтруктуры.Значение)),,,Новый КвалификаторыЧисла(15,3));
			КонецЕсли;
			ТЗОстаткиИОбороты.Колонки.Добавить(СтрокаСтруктуры.Ключ, ТипДанных);
		КонецЦикла;
		Прервать;
	КонецЦикла;
	Для Каждого СтрокаМассива Из ОстаткиИОбороты Цикл
		СтрТЗ = ТЗОстаткиИОбороты.Добавить();
		Для Каждого СтрокаСтруктуры Из СтрокаМассива Цикл
			СтрТЗ[СтрокаСтруктуры.Ключ] = СтрокаСтруктуры.Значение;
		КонецЦикла;
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗОИБ.Номенклатура КАК Номенклатура,
		|	ТЗОИБ.Склад КАК Склад,
		|	ТЗОИБ.НачальныйОстаток КАК НачальныйОстаток,
		|	ТЗОИБ.Приход КАК Приход,
		|	ТЗОИБ.Расход КАК Расход,
		|	ТЗОИБ.КонечныйОстаток КАК КонечныйОстаток,
		|	ТЗОИБ.Признак КАК Признак
		|ПОМЕСТИТЬ ТЗОст
		|ИЗ
		|	&ТЗОстаткиИОбороты КАК ТЗОИБ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗОст.Номенклатура КАК Номенклатура,
		|	ТЗОст.Склад КАК Склад,
		|	ТЗОст.НачальныйОстаток КАК НачальныйОстаток,
		|	ТЗОст.Приход КАК Приход,
		|	ТЗОст.Расход КАК Расход,
		|	ТЗОст.КонечныйОстаток КАК КонечныйОстаток,
		|	ТЗОст.Признак КАК Признак,
		|	ВложенныйЗапрос.КодВ77 КАК КодВ77
		|ИЗ
		|	ТЗОст КАК ТЗОст
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			Склад.КодВ77 КАК КодВ77
		|		ИЗ
		|			Справочник.Склад КАК Склад) КАК ВложенныйЗапрос
		|		ПО ТЗОст.Склад = ВложенныйЗапрос.КодВ77
		|
		|УПОРЯДОЧИТЬ ПО
		|	Склад,
		|	Номенклатура,
		|	Признак";
	
	Запрос.УстановитьПараметр("ТЗОстаткиИОбороты", ТЗОстаткиИОбороты);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ЗаголовокСклад = "";
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Склад <> ЗаголовокСклад Тогда
			ОбластьСклад.Параметры.Склад = ВыборкаДетальныеЗаписи.Склад;
			ЗаголовокСклад = ВыборкаДетальныеЗаписи.Склад;
			ТабДок.Вывести(ОбластьСклад);
			ТабДок.Вывести(ОбластьЗаголовокТаблицы);
			ПризнакДобавления = "";
		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.Признак = "7.7"  И (ПризнакДобавления = "" ИЛИ ПризнакДобавления = "8.3") Тогда
			ОбластьСтрока77 = Макет.ПолучитьОбласть("Строка|Колонка77");
			ОбластьСтрока77.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
			КодИНаименование = Новый Структура;
			КодИНаименование.Вставить("ДатаСверки", Объект.ДатаМесяцаСверки);
			КодИНаименование.Вставить("Склад77", ВыборкаДетальныеЗаписи.Склад);
			КодИНаименование.Вставить("Наименование", ВыборкаДетальныеЗаписи.Номенклатура);
			ОбластьСтрока77.Параметры.СеркаОборотов = КодИНаименование ;
			ТабДок.Вывести(ОбластьСтрока77);
			ПризнакДобавления = "7.7";
		ИначеЕсли ВыборкаДетальныеЗаписи.Признак = "8.3"  И ПризнакДобавления = "7.7" Тогда
			ОбластьСтрока83 = Макет.ПолучитьОбласть("Строка|Колонка83");
			ОбластьСтрока83.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
			ТабДок.Присоединить(ОбластьСтрока83);
			ПризнакДобавления = "8.3";
		ИначеЕсли ВыборкаДетальныеЗаписи.Признак = "7.7"  И ПризнакДобавления = "7.7" Тогда
			ОбластьПустая83 = Макет.ПолучитьОбласть("ПустаяСтрока|Колонка83");
			ТабДок.Присоединить(ОбластьПустая83);
			ОбластьСтрока77 = Макет.ПолучитьОбласть("Строка|Колонка77");
			ОбластьСтрока77.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
			КодИНаименование = Новый Структура;
			КодИНаименование.Вставить("ДатаСверки", Объект.ДатаМесяцаСверки);
			КодИНаименование.Вставить("Склад77", ВыборкаДетальныеЗаписи.КодВ77);
			КодИНаименование.Вставить("Наименование", ВыборкаДетальныеЗаписи.Номенклатура);
			ОбластьСтрока77.Параметры.СеркаОборотов = КодИНаименование ;
			ТабДок.Вывести(ОбластьСтрока77);
			ПризнакДобавления = "7.7";
		ИначеЕсли ПризнакДобавления = "8.3" И ПризнакДобавления = "8.3" Тогда
			ОбластьПустая77 = Макет.ПолучитьОбласть("ПустаяСтрока|Колонка77");
			ТабДок.Вывести(ОбластьПустая77);
			ОбластьСтрока83 = Макет.ПолучитьОбласть("Строка|Колонка83");
			ОбластьСтрока83.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
			ТабДок.Присоединить(ОбластьСтрока83);
			ПризнакДобавления = "8.3";
		КонецЕсли;
		
	
	КонецЦикла;
		Возврат ТабДок;
КонецФункции

&НаКлиенте
Процедура Расхождения()
	Объект.ТаблицаРасхождений = РасхожденияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРасхожденийОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;
	ЗначениеРасшифровки = Новый Структура;
	ЗначениеРасшифровки.Вставить("ДанныеНоменклатуры", Расшифровка);
	ОткрытьФорму("Отчет.СверкаОстатков.Форма.СверкаОборотовПоНоменклатуре", ЗначениеРасшифровки);
КонецПроцедуры

#КонецОбласти
